LEXICON_RU = {
    "empty_qr": "Ваша ссылка не найден.\n"
    "Напишите администратору через кнопку 'Задать вопрос',\n"
    "и он пришлет Вам ссылку лично.\n\n"
    "Скопируйте запрос: 'Здравствуйте! Пришлите мою ссылку'",
    "no_sub": "❌ У Вас нет активной подписки.",
    "yes_sub": f" ⚙️ Настройки\n\n"
    f"✅ Теперь Вам доступны описания для настройки на любой платформе из представленых ниже. \n"
    f"А так же необходимые ссылки для подключения.\n\n"
    f"Для настройки предварительно cкачайте приложение: \n\n"
    f"----------------------\n"
    f"📱 <a href='https://apps.apple.com/ru/app/streisand/id6450534064'>iPhone</a>\n"
    f"----------------------\n"
    f"🤖 <a href='https://github.com/hiddify/hiddify-next/releases/tag/v2.0.5'>Android</a>\n"
    f"----------------------\n"
    f"🍏 <a href='https://github.com/hiddify/hiddify-next/releases/tag/v2.0.5'>MacOS</a>\n"
    f"----------------------\n\n"
    f"🏠 <a href='https://github.com/hiddify/hiddify-next/releases/tag/v2.0.5'>Windows</a> \n"
    f"Выберите свою платформу для получения инструкции ⤵️",
    "iphone_support": f"📱 Подключение iPhone:\n\n"
    f"1️⃣ Установите приложение Hiddify.\n"
    f"2️⃣ Нажмите '+' и вставьте ссылку из буфера обмена.\n"
    f"3️⃣ Готово! Подключайтесь через приложение.",
    "android_support": f"🤖 Подключение Android:\n\n"
    f"1️⃣ Установите приложение Hiddify (Выберите armv8 версию)\n"
    f"2️⃣ Нажмите '+' и вставьте ссылку из буфера обмена.\n"
    f"3️⃣ Готово! Подключайтесь через приложение.",
    "macos_support": f"🍏 Подключение MacOS:\n\n"
    f"1️⃣ Установите Hiddify (Выберите DMG версию)\n"
    f"2️⃣ Нажмите '+' и вставьте ссылку из буфера обмена.\n"
    f"3️⃣ Нажмите на большую кнопку для влючения VPN.",
    "windows_support": f"🏠 Подключение для ПК:\n\n"
    f"1️⃣ Установите приложение Hiddify (setup для Windows).\n"
    f"2️⃣ Откройте приложение, нажмите '+' и вставьте ссылку из буфера обмена.\n"
    f"3️⃣ В «Параметры конфигурации» выберите:\n"
    f"   ◾️ Регион: Россия\n"
    f"   ◾️ Режим работы: VPN\n\n"
    f"4️⃣ Закройте приложение и выключите его в трее.\n"
    f"5️⃣ Запустите приложение от имени администратора:\n"
    f"   ◾️ Найдите иконку Hiddify на рабочем столе.\n"
    f"   ◾️ Щелкните правой кнопкой мыши и выберите «Запустить от имени администратора».\n\n"
    f"6️⃣ В приложении нажмите большую кнопку включения VPN.\n\n"
    f"Все готово! Можете проверять доступ к сайтам. ✅",
    "to_ask_support": "Напишите ваш вопрос в <b>этом чате</b>, и администратор ответит.",
    "FAQ": f"ℹ️ Частые вопросы:\n\n"
    f"▫️ Что такое VPN?\n"
    f"Безопасное соединение, шифрующее ваш трафик.\n\n"
    f"▫️ Как настроить VPN?\n"
    f"Скачайте приложение и следуйте инструкции для своей платформы.\n\n",
    "menu": f"🔸 <b>Главное меню:</b>\n\n"
    f"💲 <b>Оплатить</b> — для активации подписки.\n"
    f"♾ <b>Мои настройки</b> — инструкции и файлы подключения.\n"
    f"✔️ <b>Профиль</b> — статус подписки.\n"
    f"🗨 <b>Поддержка</b> — связь с администратором.",
}

TRANSACTIONS = {
    "PENDING": " ОЖИДАНИЕ ПОСТУПЛЕНИЯ",
    "WAITING_FOR_CONFIRMATIONS": "ОЖИДАНИЕ ПОДТВЕРЖДЕНИЙ",
    "COMPLETED": "ЗАВЕРШЕНО",
    "Cancelled": "ОТМЕНЕН",
}
